html/kotlin/introduction/javascript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kotlin JavaScript 概述</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="server.html"> UP </a>
 |
 <a accesskey="H" href="introduction.html"> HOME </a>
</div><div id="content">
<h1 class="title">Kotlin JavaScript 概述</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org62ff63a">使用</a></li>
</ul>
</div>
</div>
<p>
Kotlin 提供了 JavaScript 作为目标平台的能力。它通过将 Kotlin 转换为 JavaScript 来实现
</p>

<pre class="example">
  目前的实现目标是 ECMAScript 5.1，但也有最终目标为 ECMAScript 2015 的计划
</pre>

<p>
当选择 JavaScript 目标时，作为项目一部分的任何 Kotlin 代码以及 Kotlin 附带的标准库都会转换为 JavaScript
</p>

<pre class="example">
  然而，这不包括使用的 JDK 和任何 JVM 或 Java 框架或库。任何不是 Kotlin 的文件会在编译期间忽略掉
</pre>

<p>
Kotlin 编译器努力遵循以下目标：
</p>
<ul class="org-ul">
<li>提供最佳大小的输出</li>
<li>提供可读的 JavaScript 输出</li>
<li>提供与现有模块系统的互操作性</li>
<li>在标准库中提供相同的功能，无论是 JavaScript 还是 JVM 目标（尽最大可能程度）</li>
</ul>
<div id="outline-container-org62ff63a" class="outline-2">
<h2 id="org62ff63a">使用</h2>
<div class="outline-text-2" id="text-org62ff63a">
<p>
在以下情景中将 Kotlin 编译为 JavaScript：
</p>
<ul class="org-ul">
<li>创建面向客户端 JavaScript 的 Kotlin 代码
<ul class="org-ul">
<li>与 <b>DOM</b> 元素交互：Kotlin 提供了一系列静态类型的接口来与文档对象模型（Document Object Model）交互，允许创建和更新 DOM 元素</li>
<li>与图形如 <b>WebGL</b> 交互：可以使用 Kotlin 在网页上用 WebGL 创建图形元素</li>
</ul></li>
<li>创建面向服务器端 JavaScript 的 Kotlin 代码
<ul class="org-ul">
<li>使用 <b>服务器端</b> 技术：可以使用 Kotlin 与服务器端 JavaScript（如 Node.js）进行交互</li>
</ul></li>
</ul>

<pre class="example">
Kotlin 可以与现有的第三方库和框架（如 jQuery 或 ReactJS）一起使用

要使用强类型 API 访问第三方框架，可以使用 dukat 工具将 TypeScript 定义从 Definitely Typed 类型定义仓库转换为 Kotlin。或者，可以使用动态类型访问任何框架，而无需强类型

JetBrains 特地为 React 社区开发并维护了几个工具：React bindings 以及 Create React Kotlin App。后者可以帮你开始使用 Kotlin 构建 React 应用程序而无需构建配置

Kotlin 兼容 CommonJS、AMD 和 UMD，直截了当与不同的模块系统交互
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="native.html">Next：原生开发</a></td>
<td class="org-left"><a href="server.html">Previous：服务器端</a></td>
<td class="org-left"><a href="introduction.html">Home：概述</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
